## Plan Result (sbox_mgmt - TerraformPlanApply)




<pre><code>Plan: 26 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-apl-ack-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-apl-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-apl-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-bl-ack-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-bl-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-bl-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-joh-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-joh-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-td-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-td-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules[&#34;evh-apl-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules[&#34;evh-bl-ack-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules[&#34;evh-bl-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules[&#34;evh-bl-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules[&#34;evh-joh-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules[&#34;evh-joh-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules[&#34;evh-td-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules[&#34;evh-td-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups[&#34;evh-apl-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups[&#34;evh-apl-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups[&#34;evh-joh-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups[&#34;evh-td-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups[&#34;evh-td-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace
  * module.data_mgmt_zone.azurerm_eventhub_namespace_authorization_rule.eventhub-sender
  * module.data_mgmt_zone.azurerm_eventhub_namespace_authorization_rule.eventhub_namespace_auth_rules[&#34;RootManageSharedAccessKey&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-apl-ack-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apl-ack-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-apl-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apl-dl-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-apl-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apl-pub-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 18
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-bl-ack-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-ack-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 10
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-bl-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-dl-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 8
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-bl-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-pub-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-joh-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-dl-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-joh-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-pub-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 18
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-td-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-dl-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-td-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-pub-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 18
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules["evh-apl-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "eventhub_auth_rules" {
      + eventhub_name                     = "evh-apl-dl-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "manager"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules["evh-bl-ack-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "eventhub_auth_rules" {
      + eventhub_name                     = "evh-bl-ack-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "ariabailsack"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules["evh-bl-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "eventhub_auth_rules" {
      + eventhub_name                     = "evh-bl-dl-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "evh-bl-dl-dev-uks-dlrm-01"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules["evh-bl-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "eventhub_auth_rules" {
      + eventhub_name                     = "evh-bl-pub-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria-bails"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules["evh-joh-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "eventhub_auth_rules" {
      + eventhub_name                     = "evh-joh-dl-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "JOH-deadletterque"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules["evh-joh-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "eventhub_auth_rules" {
      + eventhub_name                     = "evh-joh-pub-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "ADLSAccountKey"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules["evh-td-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "eventhub_auth_rules" {
      + eventhub_name                     = "evh-td-dl-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "test-dl"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules["evh-td-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "eventhub_auth_rules" {
      + eventhub_name                     = "evh-td-pub-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "test-nsa"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups["evh-apl-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_consumer_group" "eventhub_consumer_groups" {
      + eventhub_name       = "evh-apl-dl-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "test"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups["evh-apl-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_consumer_group" "eventhub_consumer_groups" {
      + eventhub_name       = "evh-apl-pub-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "preview_data_consumer_group"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups["evh-joh-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_consumer_group" "eventhub_consumer_groups" {
      + eventhub_name       = "evh-joh-pub-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "preview_data_consumer_group"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups["evh-td-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_consumer_group" "eventhub_consumer_groups" {
      + eventhub_name       = "evh-td-dl-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "test"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups["evh-td-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_consumer_group" "eventhub_consumer_groups" {
      + eventhub_name       = "evh-td-pub-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "preview_data_consumer_group"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace will be created
  + resource "azurerm_eventhub_namespace" "eventhub-namespace" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 16
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "uksouth"
      + maximum_throughput_units                  = 0
      + minimum_tls_version                       = "1.2"
      + name                                      = "sbox-dlrm-eventhub-ns"
      + network_rulesets                          = [
          + {
              + default_action                 = "Allow"
              + public_network_access_enabled  = true
              + trusted_service_access_enabled = false
            },
        ]
      + public_network_access_enabled             = true
      + resource_group_name                       = "ingest-mgmt-rg-sbox"
      + sku                                       = "Premium"
      + tags                                      = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.data_mgmt_zone.azurerm_eventhub_namespace_authorization_rule.eventhub-sender will be created
  + resource "azurerm_eventhub_namespace_authorization_rule" "eventhub-sender" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "dlrm-eventhub-namespace-sender"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_namespace_authorization_rule.eventhub_namespace_auth_rules["RootManageSharedAccessKey"] will be created
  + resource "azurerm_eventhub_namespace_authorization_rule" "eventhub_namespace_auth_rules" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "RootManageSharedAccessKey"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 26 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":70,"Program":"tfcmt","SHA1":"","Target":"sbox_mgmt - TerraformPlanApply","Vars":{}} -->